In [4]:
!rm -rf /content/SQL-of-Thought
!git clone https://github.com/shollercoaster/SQL-of-Thought.git
!pip install -q openai gdown

import gdown, zipfile, os
if not os.path.exists('/content/spider'):
    gdown.download(id='1TqleXec_OykOYFREKKtschzY29dUcVAQ', output='/content/spider.zip', quiet=False)
    with zipfile.ZipFile('/content/spider.zip','r') as z:
        z.extractall('/content/')

Cloning into 'SQL-of-Thought'...
remote: Enumerating objects: 11, done.
remote: Counting objects: 100% (11/11), done.
remote: Compressing objects: 100% (11/11), done.
remote: Total 11 (delta 2), reused 3 (delta 0), pack-reused 0 (from 0)
Receiving objects: 100% (11/11), 19.01 KiB | 973.00 KiB/s, done.
Resolving deltas: 100% (2/2), done.

In [5]:
import os, json, shutil
os.chdir('/content/SQL-of-Thought')

# grab the error taxonomy file whatever it's called
for f in os.listdir('.'):
    if 'error_taxonomy' in f and f.endswith('.json') and f != 'error_taxonomy.json':
        shutil.copy(f, 'error_taxonomy.json')
        break

os.makedirs('ablations_actual', exist_ok=True)
if not os.path.exists('nl2sql_bugs.json'):
    json.dump([], open('nl2sql_bugs.json','w'))

# repo doesn't have this file so writing a minimal version
with open('analyze_by_subproblems.py','w') as f:
    f.write("""import json

def parse_subproblems(s):
    if isinstance(s, str):
        try: data = json.loads(s)
        except: return []
    elif isinstance(s, dict): data = s
    else: return []
    return [sp.get("clause","").strip().upper()
            for sp in data.get("subproblems",[])
            if sp.get("clause","").strip()]
""")

# patch utils.py - fix paths, missing deps, client init
with open('utils.py','r') as f:
    lines = f.readlines()

out = []
i = 0
while i < len(lines):
    ln = lines[i].replace('../../spider/', '/content/spider/')

    if ln.strip() == 'import anthropic':
        out += ['try:\n','    import anthropic\n','except ImportError:\n','    anthropic = None\n']
        i+=1; continue

    if ln.strip().startswith('openai_client = OpenAI('):
        out.append('openai_client = None\n')
        i+=1; continue

    if ln.strip() == 'import torch' and i+1<len(lines) and 'from transformers' in lines[i+1]:
        out += ['try:\n','    import torch\n',
                '    from transformers import AutoTokenizer, AutoModelForCausalLM\n',
                'except ImportError:\n','    torch = None\n',
                '    AutoTokenizer = None\n','    AutoModelForCausalLM = None\n']
        i+=2; continue

    if ln.startswith('def load_local_model('):
        out.append("""
def init_clients(use_openai=True, use_anthropic=False, use_local=False, base_url=None):
    global openai_client, client, model, tokenizer
    if use_openai:
        kw = {"api_key": OPENAI_API_KEY}
        if base_url: kw["base_url"] = base_url
        openai_client = OpenAI(**kw)
    if use_anthropic and anthropic:
        client = anthropic.Anthropic(api_key=ANTHROPIC_API_KEY)
    if use_local:
        model, tokenizer = load_local_model()

""")
        out.append(ln); i+=1; continue

    if ln.strip() == 'model, tokenizer = load_local_model()':
        out.append('model, tokenizer = None, None\n'); i+=1; continue
    if 'client = anthropic.Anthropic(' in ln:
        out.append('client = None\n'); i+=1; continue
    if 'model= "gpt-5"' in ln:
        ln = ln.replace('model= "gpt-5", # "gpt-3.5-turbo",','model=model,')
    if 'open("../../nl2sql_bugs.json")' in ln:
        ln = ln.replace('open("../../nl2sql_bugs.json")','open("nl2sql_bugs.json")')

    out.append(ln)
    i+=1

with open('utils.py','w') as f:
    f.writelines(out)

# same path fix for eval script
with open('run_eval_single_schemalink.py','r') as f:
    src = f.read()
with open('run_eval_single_schemalink.py','w') as f:
    f.write(src.replace('../../spider/','/content/spider/'))

print("done patching")

done patching

In [6]:
import os, sys, json
from getpass import getpass

os.chdir('/content/SQL-of-Thought')
os.environ["OPENAI_API_KEY"] = getpass("api key: ")

for m in ['utils','prompts','analyze_by_subproblems']:
    if m in sys.modules: del sys.modules[m]

from utils import (init_clients, load_spider, load_schema, call_agent,
                   postprocess_sql, query_execution, exec_query,
                   clean_json, clause_specific_prompts)
from prompts import (alt_schema_linking_agent_prompt, subproblem_agent_prompt,
                     query_plan_agent_prompt, sql_agent_prompt,
                     correction_plan_agent_prompt, correction_sql_agent_prompt)
from analyze_by_subproblems import parse_subproblems

init_clients(use_openai=True, base_url="https://api.deepseek.com")

# quick sanity check
print(call_agent("Say hi.", "deepseek-chat"))

N = 100
MAX_FIX = 3
MDL = "deepseek-chat"

api key: 路路路路路路路路路路
Hello!  It's great to meet you. How can I help you today?

In [7]:
def run(gen_fn, tag, correct=True):
    dev = load_spider(dev=True)
    tot = em = vs = ea = 0
    rows = []

    for i, item in enumerate(dev[:N]):
        q, gold, db = item['question'], item['query'], item['db_id']
        schema = load_schema(db)
        sql = ""
        ok = False
        print(f"\n[{i+1}/{N}] {q}")

        try:
            sql, ctx = gen_fn(q, schema, db)
            print(f"  -> {sql}")
            ok, err = query_execution(item, sql)

            if correct:
                att = 0
                while not ok and att < MAX_FIX:
                    cp = call_agent(correction_plan_agent_prompt(q, sql, ctx, err), MDL)
                    sql = postprocess_sql(call_agent(
                        correction_sql_agent_prompt(q, ctx, cp, sql), MDL))
                    print(f"  fix{att+1}: {sql}")
                    ok, err = query_execution(item, sql)
                    att += 1
        except Exception as e:
            print(f"  ERR: {e}")

        gc = postprocess_sql(gold)
        is_em = sql.strip().lower() == gc.strip().lower()
        _, ge = exec_query(f"/content/spider/database/{db}/{db}.sqlite", sql)
        is_vs = ge is None

        if is_em: em += 1
        if is_vs: vs += 1
        if ok: ea += 1
        tot += 1
        rows.append({"question":q, "db_id":db, "gold":gc, "gen":sql,
                      "em":is_em, "valid":is_vs, "exec":ok})
        print(f"  gold: {gc}")
        print(f"  EM={em}/{tot} EA={ea}/{tot} VS={vs}/{tot}")

    s = {"total":tot, "em":em, "vs":vs, "ea":ea,
         "em%":round(em/tot,4), "vs%":round(vs/tot,4), "ea%":round(ea/tot,4)}
    path = f"ablations_actual/{N}_deepseek_{tag}.json"
    json.dump({"summary":s, "results":rows}, open(path,"w"), indent=2)
    print(f"\n=== {tag} === {json.dumps(s)}")
    return s


# generation functions for each variant

def gen_sot(q, sch, db):
    cs = call_agent(alt_schema_linking_agent_prompt(q, sch), MDL)
    sj = clean_json(call_agent(subproblem_agent_prompt(q, cs), MDL))
    cl = list(set(parse_subproblems(sj)))
    clause_specific_prompts(cl)
    plan = call_agent(query_plan_agent_prompt(q, cs, sj), MDL)
    sql = postprocess_sql(call_agent(sql_agent_prompt(q, plan, cs), MDL))
    return sql, cs

def gen_nosub(q, sch, db):
    cs = call_agent(alt_schema_linking_agent_prompt(q, sch), MDL)
    plan = call_agent(query_plan_agent_prompt(q, cs, "{}"), MDL)
    sql = postprocess_sql(call_agent(sql_agent_prompt(q, plan, cs), MDL))
    return sql, cs

def gen_noschema(q, sch, db):
    sj = clean_json(call_agent(subproblem_agent_prompt(q, sch), MDL))
    cl = list(set(parse_subproblems(sj)))
    clause_specific_prompts(cl)
    plan = call_agent(query_plan_agent_prompt(q, sch, sj), MDL)
    sql = postprocess_sql(call_agent(sql_agent_prompt(q, plan, sch), MDL))
    return sql, sch

def gen_direct(q, sch, db):
    p = f"Given this schema:\n{sch}\n\nWrite a SQLite query for: {q}\n\nOutput only SQL."
    return postprocess_sql(call_agent(p, MDL)), sch

In [8]:
r1 = run(gen_sot, "sot_full")

[1/100] How many singers do we have?
  -> select count(distinct singer.singer_id) from singer
  gold: select count(*) from singer
  EM=0/1 EA=1/1 VS=1/1

[2/100] What is the total number of singers?
  -> select count(*) from singer
  gold: select count(*) from singer
  EM=1/2 EA=2/2 VS=2/2

[3/100] Show name, country, age for all singers ordered by age from the oldest to the youngest.
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=2/3 EA=3/3 VS=3/3

[4/100] What are the names, countries, and ages for every singer in descending order of age?
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=3/4 EA=4/4 VS=4/4

[5/100] What is the average, minimum, and maximum age of all singers from France?
  -> select avg(singer.age), min(singer.age), max(singer.age) from singer where singer.country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=3/5 EA=5/5 VS=5/5

[6/100] What is the average, minimum, and maximum age for all French singers?
  -> select avg(age), min(age), max(age) from singer where country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=4/6 EA=6/6 VS=6/6

[7/100] Show the name and the release year of the song by the youngest singer.
  -> select s.name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  fix1: select name, song_release_year from singer where age = (select min(age) from singer)
  fix2: select song_name, song_release_year from singer where age = (select min(age) from singer) order by song_release_year desc limit 1
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=4/7 EA=7/7 VS=7/7

[8/100] What are the names and release years for all the songs of the youngest singer?
  -> select s.name, s.song_name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  fix1: select s.name, s.song_name, s.song_release_year from singer s where s.singer_id in ( select singer_id from singer where age = (select min(age) from singer) )
  fix2: select name, song_release_year from singer where singer_id in (select singer_id from singer where age = (select min(age) from singer))
  fix3: select song_name, song_release_year from singer where age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=4/8 EA=8/8 VS=8/8

[9/100] What are all distinct countries where singers above age 20 are from?
  -> select distinct singer.country from singer where singer.age > 20
  gold: select distinct country from singer where age > 20
  EM=4/9 EA=9/9 VS=9/9

[10/100] What are  the different countries with singers above age 20?
  -> select distinct country from singer where age > 20
  gold: select distinct country from singer where age > 20
  EM=5/10 EA=10/10 VS=10/10

[11/100] Show all countries and the number of singers in each country.
  -> select singer.country, count(singer.singer_id) from singer group by singer.country
  gold: select country, count(*) from singer group by country
  EM=5/11 EA=11/11 VS=11/11

[12/100] How many singers are from each country?
  -> select singer.country, count(distinct singer.singer_id) from singer group by singer.country
  gold: select country, count(*) from singer group by country
  EM=5/12 EA=12/12 VS=12/12

[13/100] List all song names by singers above the average age.
  -> select distinct song.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join song on singer_in_concert.concert_id = song.concert_id where singer.age > (select avg(age) from singer)
  fix1: select name from singer where age > (select avg(age) from singer)
  fix2: select distinct s.song_name from singer as sg inner join singer_in_concert as sic on sg.singer_id = sic.singer_id inner join concert as c on sic.concert_id = c.concert_id inner join song as s on c.concert_id = s.concert_id where sg.age > (select avg(age) from singer)
  fix3: select distinct s.song_name from singer as sg inner join singer_in_concert as sic on sg.singer_id = sic.singer_id inner join concert as c on sic.concert_id = c.concert_id inner join song as s on c.concert_id = s.concert_id where sg.age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=5/13 EA=12/13 VS=12/13

[14/100] What are all the song names by singers who are older than average?
  -> select distinct song_name from singer where age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=5/14 EA=13/14 VS=13/14

[15/100] Show location and name for all stadiums with a capacity between 5000 and 10000.
  -> select stadium.location, stadium.name from stadium where stadium.capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=5/15 EA=14/15 VS=14/15

[16/100] What are the locations and names of all stations with capacity between 5000 and 10000?
  -> select location, name from stadium where capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=6/16 EA=15/16 VS=15/16

[17/100] What is the maximum capacity and the average of all stadiums ?
  -> select max(capacity), avg(average) from stadium
  fix1: select max(capacity), avg(capacity) from stadium
  fix2: select max(capacity), avg(average) from stadium
  fix3: select max(capacity), avg(capacity) from stadium
  gold: select max(capacity), average from stadium
  EM=6/17 EA=15/17 VS=16/17

[18/100] What is the average and maximum capacities for all stadiums ?
  -> select avg(capacity), max(capacity) from stadium
  gold: select avg(capacity), max(capacity) from stadium
  EM=7/18 EA=16/18 VS=17/18

[19/100] What is the name and capacity for the stadium with highest average attendance?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name, stadium.capacity order by avg(concert.attendance) desc limit 1
  fix1: select name, capacity from stadium order by average desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=8/19 EA=17/19 VS=18/19

[20/100] What is the name and capacity for the stadium with the highest average attendance?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by stadium.stadium_id, stadium.name, stadium.capacity order by avg(stadium.average) desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=8/20 EA=18/20 VS=19/20

[21/100] How many concerts are there in year 2014 or 2015?
  -> select count(*) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=8/21 EA=19/21 VS=20/21

[22/100] How many concerts occurred in 2014 or 2015?
  -> select count(*) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=8/22 EA=20/22 VS=21/22

[23/100] Show the stadium name and the number of concerts in each stadium.
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=8/23 EA=21/23 VS=22/23

[24/100] For each stadium, how many concerts play there?
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=8/24 EA=22/24 VS=23/24

[25/100] Show the stadium name and capacity with most number of concerts in year 2014 or after.
  -> select s.name, s.capacity from stadium s join concert c on s.stadium_id = c.stadium_id where c.year >= 2014 group by s.stadium_id, s.name, s.capacity order by count(c.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t2.stadium_id order by count(*) desc limit 1
  EM=8/25 EA=23/25 VS=24/25

[26/100] What is the name and capacity of the stadium with the most concerts after 2013 ?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id join singer_in_concert on concert.concert_id = singer_in_concert.concert_id where concert.year > 2013 group by stadium.stadium_id, stadium.name, stadium.capacity having count(concert.concert_id) = (select max(concert_count) from (select count(concert_id) as concert_count from concert where year > 2013 group by stadium_id) as sub)
  fix1: select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year > 2013 group by stadium.stadium_id, stadium.name, stadium.capacity having count(concert.concert_id) = ( select max(concert_count) from ( select count(concert_id) as concert_count from concert where year > 2013 group by stadium_id ) as sub )
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year > 2013 group by t2.stadium_id order by count(*) desc limit 1
  EM=8/26 EA=24/26 VS=25/26

[27/100] Which year has most number of concerts?
  -> select concert.year, count(concert.concert_id) as concert_count from concert group by concert.year order by concert_count desc limit 1
  fix1: select concert.year, count(*) as performance_count from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.year order by performance_count desc limit 1
  fix2: select year, count(*) as concert_count from concert group by year order by concert_count desc limit 1
  fix3: select concert.year, count(distinct concert.concert_id) as concert_count from concert inner join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.year order by concert_count desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=8/27 EA=24/27 VS=26/27

[28/100] What is the year that had the most concerts?
  -> select concert.year, count(concert.concert_id) as concert_count from concert group by concert.year order by concert_count desc limit 1
  fix1: select concert.year, count(distinct concert.concert_id) as concert_count from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.year order by concert_count desc limit 1
  fix2: select concert.year, count(*) as concert_count from concert group by concert.year order by concert_count desc limit 1
  fix3: select year from concert group by year order by count(*) desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=9/28 EA=25/28 VS=27/28

[29/100] Show the stadium names without any concert.
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=9/29 EA=26/29 VS=28/29

[30/100] What are the names of the stadiums without any concerts?
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=9/30 EA=27/30 VS=29/30

[31/100] Show countries where a singer above age 40 and a singer below 30 are from.
  -> select distinct country from singer where age > 40 intersect select distinct country from singer where age < 30
  gold: select country from singer where age > 40 intersect select country from singer where age < 30
  EM=9/31 EA=28/31 VS=30/31

[32/100] Show names for all stadiums except for stadiums having a concert in year 2014.
  -> select stadium.name from stadium where stadium.stadium_id not in (select concert.stadium_id from concert where concert.year = 2014)
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=9/32 EA=29/32 VS=31/32

[33/100] What are the names of all stadiums that did not have a concert in 2014?
  -> select stadium.name from stadium except select stadium.name from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2014
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=9/33 EA=30/33 VS=32/33

[34/100] Show the name and theme for all concerts and the number of singers in each concert.
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as singer_count from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=9/34 EA=31/34 VS=33/34

[35/100] What are the names , themes , and number of singers for every concert ?
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as number_of_singers from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=9/35 EA=32/35 VS=34/35

[36/100] List singer names and number of concerts for each singer.
  -> select singer.name, count(singer_in_concert.concert_id) as number_of_concerts from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=9/36 EA=33/36 VS=35/36

[37/100] What are the names of the singers and number of concerts for each person?
  -> select singer.name, count(singer_in_concert.concert_id) as number_of_concerts from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=9/37 EA=34/37 VS=36/37

[38/100] List all singer names in concerts in year 2014.
  -> select distinct singer.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix1: select distinct singer.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix2: select distinct singer.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix3: select distinct singer.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=9/38 EA=34/38 VS=37/38

[39/100] What are the names of the singers who performed in a concert in 2014?
  -> select distinct singer.name from singer_in_concert join concert on singer_in_concert.concert_id = concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id where concert.year = 2014
  fix1: select distinct singer.singer_id, singer.name from singer_in_concert join concert on singer_in_concert.concert_id = concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id where concert.year = 2014
  fix2: select distinct singer.name from singer_in_concert join concert on singer_in_concert.concert_id = concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id where concert.year = 2014
  fix3: select distinct singer.name from singer_in_concert join concert on singer_in_concert.concert_id = concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=9/39 EA=34/39 VS=38/39

[40/100] what is the name and nation of the singer who have a song having 'Hey' in its name?
  -> select singer.name, singer.country from singer where singer.song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=9/40 EA=35/40 VS=39/40

[41/100] What is the name and country of origin of every singer who has a song with the word 'Hey' in its title?
  -> select distinct name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=9/41 EA=36/41 VS=40/41

[42/100] Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015.
  -> select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2014 intersect select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2015
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=9/42 EA=37/42 VS=41/42

[43/100] What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015?
  -> select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2014 intersect select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2015
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=9/43 EA=38/43 VS=42/43

[44/100] Find the number of concerts happened in the stadium with the highest capacity .
  -> select count(concert.concert_id) from concert join stadium on concert.stadium_id = stadium.stadium_id where stadium.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=9/44 EA=39/44 VS=43/44

[45/100] What are the number of concerts that occurred in the stadium with the largest capacity ?
  -> select count(concert.concert_id) from stadium order by stadium.capacity desc limit 1 join concert on stadium.stadium_id = concert.stadium_id

In [9]:
r2 = run(gen_sot, "no_correction", correct=False)

[1/100] How many singers do we have?
  -> select count(distinct singer.singer_id) from singer
  gold: select count(*) from singer
  EM=0/1 EA=1/1 VS=1/1

[2/100] What is the total number of singers?
  -> select count(distinct singer.singer_id) from singer
  gold: select count(*) from singer
  EM=0/2 EA=2/2 VS=2/2

[3/100] Show name, country, age for all singers ordered by age from the oldest to the youngest.
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=1/3 EA=3/3 VS=3/3

[4/100] What are the names, countries, and ages for every singer in descending order of age?
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=2/4 EA=4/4 VS=4/4

[5/100] What is the average, minimum, and maximum age of all singers from France?
  -> select avg(singer.age), min(singer.age), max(singer.age) from singer where singer.country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/5 EA=5/5 VS=5/5

[6/100] What is the average, minimum, and maximum age for all French singers?
  -> select avg(age), min(age), max(age) from singer where country = 'french'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/6 EA=6/6 VS=6/6

[7/100] Show the name and the release year of the song by the youngest singer.
  -> select s.name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/7 EA=6/7 VS=7/7

[8/100] What are the names and release years for all the songs of the youngest singer?
  -> select name, song_name, song_release_year from singer where age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/8 EA=6/8 VS=8/8

[9/100] What are all distinct countries where singers above age 20 are from?
  -> select distinct singer.country from singer where singer.age > 20
  gold: select distinct country from singer where age > 20
  EM=2/9 EA=7/9 VS=9/9

[10/100] What are  the different countries with singers above age 20?
  -> select distinct singer.country from singer where singer.age > 20
  gold: select distinct country from singer where age > 20
  EM=2/10 EA=8/10 VS=10/10

[11/100] Show all countries and the number of singers in each country.
  -> select singer.country, count(singer.singer_id) from singer group by singer.country
  gold: select country, count(*) from singer group by country
  EM=2/11 EA=9/11 VS=11/11

[12/100] How many singers are from each country?
  -> select singer.country, count(singer.singer_id) from singer group by singer.country
  gold: select country, count(*) from singer group by country
  EM=2/12 EA=10/12 VS=12/12

[13/100] List all song names by singers above the average age.
  -> select song_name from singer where age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=3/13 EA=11/13 VS=13/13

[14/100] What are all the song names by singers who are older than average?
  -> select singer.name, singer.song_name from singer where singer.age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=3/14 EA=11/14 VS=14/14

[15/100] Show location and name for all stadiums with a capacity between 5000 and 10000.
  -> select stadium.location, stadium.name from stadium where stadium.capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=3/15 EA=12/15 VS=15/15

[16/100] What are the locations and names of all stations with capacity between 5000 and 10000?
  -> select stadium.location, stadium.name from stadium where stadium.capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=3/16 EA=13/16 VS=16/16

[17/100] What is the maximum capacity and the average of all stadiums ?
  -> select max(capacity), avg(average) from stadium
  gold: select max(capacity), average from stadium
  EM=3/17 EA=13/17 VS=17/17

[18/100] What is the average and maximum capacities for all stadiums ?
  -> select avg(stadium.capacity), max(stadium.capacity) from stadium
  gold: select avg(capacity), max(capacity) from stadium
  EM=3/18 EA=14/18 VS=18/18

[19/100] What is the name and capacity for the stadium with highest average attendance?
  -> select name, capacity from stadium order by average desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=4/19 EA=15/19 VS=19/19

[20/100] What is the name and capacity for the stadium with the highest average attendance?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name, stadium.capacity order by avg(stadium.average) desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=4/20 EA=16/20 VS=20/20

[21/100] How many concerts are there in year 2014 or 2015?
  -> select count(concert.concert_id) from concert where concert.year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=4/21 EA=17/21 VS=21/21

[22/100] How many concerts occurred in 2014 or 2015?
  -> select count(concert.concert_id) from concert where concert.year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=4/22 EA=18/22 VS=22/22

[23/100] Show the stadium name and the number of concerts in each stadium.
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=4/23 EA=19/23 VS=23/23

[24/100] For each stadium, how many concerts play there?
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=4/24 EA=20/24 VS=24/24

[25/100] Show the stadium name and capacity with most number of concerts in year 2014 or after.
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year >= 2014 group by stadium.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t2.stadium_id order by count(*) desc limit 1
  EM=4/25 EA=21/25 VS=25/25

[26/100] What is the name and capacity of the stadium with the most concerts after 2013 ?
  -> select stadium.name, stadium.capacity, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year > 2013 group by stadium.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year > 2013 group by t2.stadium_id order by count(*) desc limit 1
  EM=4/26 EA=21/26 VS=26/26

[27/100] Which year has most number of concerts?
  -> select concert.year, count(concert.concert_id) as concert_count from concert group by concert.year order by concert_count desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=4/27 EA=21/27 VS=27/27

[28/100] What is the year that had the most concerts?
  -> select concert.year, count(concert.concert_id) as concert_count from concert group by concert.year order by concert_count desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=4/28 EA=21/28 VS=28/28

[29/100] Show the stadium names without any concert.
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=4/29 EA=22/29 VS=29/29

[30/100] What are the names of the stadiums without any concerts?
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=4/30 EA=23/30 VS=30/30

[31/100] Show countries where a singer above age 40 and a singer below 30 are from.
  -> select distinct s1.country from singer s1 join singer s2 on s1.country = s2.country where s1.age > 40 and s2.age < 30
  gold: select country from singer where age > 40 intersect select country from singer where age < 30
  EM=4/31 EA=24/31 VS=31/31

[32/100] Show names for all stadiums except for stadiums having a concert in year 2014.
  -> select name from stadium except select stadium.name from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2014
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=4/32 EA=25/32 VS=32/32

[33/100] What are the names of all stadiums that did not have a concert in 2014?
  -> select name from stadium where stadium_id not in (select stadium_id from concert where year = 2014)
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=4/33 EA=26/33 VS=33/33

[34/100] Show the name and theme for all concerts and the number of singers in each concert.
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as singer_count from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=4/34 EA=27/34 VS=34/34

[35/100] What are the names , themes , and number of singers for every concert ?
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as number_of_singers from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=4/35 EA=28/35 VS=35/35

[36/100] List singer names and number of concerts for each singer.
  -> select singer.name, count(concert.concert_id) as number_of_concerts from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=4/36 EA=29/36 VS=36/36

[37/100] What are the names of the singers and number of concerts for each person?
  -> select singer.name, count(singer_in_concert.concert_id) as number_of_concerts from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=4/37 EA=30/37 VS=37/37

[38/100] List all singer names in concerts in year 2014.
  -> select distinct singer.name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=4/38 EA=30/38 VS=38/38

[39/100] What are the names of the singers who performed in a concert in 2014?
  -> select singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=4/39 EA=31/39 VS=39/39

[40/100] what is the name and nation of the singer who have a song having 'Hey' in its name?
  -> select singer.name, singer.country from singer where singer.song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=4/40 EA=32/40 VS=40/40

[41/100] What is the name and country of origin of every singer who has a song with the word 'Hey' in its title?
  -> select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=5/41 EA=33/41 VS=41/41

[42/100] Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015.
  -> select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2014 intersect select stadium.name, stadium.location from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year = 2015
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=5/42 EA=34/42 VS=42/42

[43/100] What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015?
  -> select s.name, s.location from stadium s where s.stadium_id in ( select stadium_id from concert where year = 2014 intersect select stadium_id from concert where year = 2015 ) group by s.stadium_id, s.name, s.location
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=5/43 EA=35/43 VS=43/43

[44/100] Find the number of concerts happened in the stadium with the highest capacity .
  -> select count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id where stadium.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=5/44 EA=36/44 VS=44/44

[45/100] What are the number of concerts that occurred in the stadium with the largest capacity ?
  -> select count(concert.concert_id) from concert join stadium on concert.stadium_id = stadium.stadium_id where stadium.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=5/45 EA=37/45 VS=45/45

[46/100] Find the number of pets whose weight is heavier than 10.
  -> select count(pets.petid) from pets where pets.weight > 10
  gold: select count(*) from pets where weight > 10
  EM=5/46 EA=38/46 VS=46/46

[47/100] How many pets have a greater weight than 10?
  -> select count(distinct pets.petid) from pets join has_pet on pets.petid = has_pet.petid where pets.weight > 10
  gold: select count(*) from pets where weight > 10
  EM=5/47 EA=39/47 VS=47/47

[48/100] Find the weight of the youngest dog.
  -> select pets.weight from pets join has_pet on pets.petid = has_pet.petid where pets.pettype = 'dog' order by pets.pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=5/48 EA=40/48 VS=48/48

[49/100] How much does the youngest dog weigh?
  -> select pets.weight from pets join has_pet on pets.petid = has_pet.petid where pets.pettype = 'dog' order by pets.pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=5/49 EA=41/49 VS=49/49

[50/100] Find the maximum weight for each type of pet. List the maximum weight and pet type.
  -> select pettype, max(weight) as max_weight from pets group by pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=5/50 EA=42/50 VS=50/50

[51/100] List the maximum weight and type for each type of pet.
  -> select pets.pettype, max(pets.weight) as max_weight from pets group by pets.pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=5/51 EA=43/51 VS=51/51

[52/100] Find number of pets owned by students who are older than 20.
  -> select count(pets.petid) from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where student.age > 20
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t1.age > 20
  EM=5/52 EA=44/52 VS=52/52

[53/100] How many pets are owned by students that have an age greater than 20?
  -> select count(distinct has_pet.petid) from student join has_pet on student.stuid = has_pet.stuid where student.age > 20
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t1.age > 20
  EM=5/53 EA=45/53 VS=53/53

[54/100] Find the number of dog pets that are raised by female students (with sex F).
  -> select count(pets.petid) from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where pets.pettype = 'dog' and student.sex = 'f'
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t2.petid = t3.petid where t1.sex = 'f' and t3.pettype = 'dog'
  EM=5/54 EA=46/54 VS=54/54

[55/100] How many dog pets are raised by female students?
  -> select count(pets.petid) from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where pets.pettype = 'dog' and student.sex = 'female'
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t2.petid = t3.petid where t1.sex = 'f' and t3.pettype = 'dog'
  EM=5/55 EA=47/55 VS=55/55

[56/100] Find the number of distinct type of pets.
  -> select count(distinct pettype) from pets
  gold: select count(distinct pettype) from pets
  EM=6/56 EA=48/56 VS=56/56

[57/100] How many different types of pet are there?
  -> select count(distinct pets.pettype) from pets
  gold: select count(distinct pettype) from pets
  EM=6/57 EA=49/57 VS=57/57

[58/100] Find the first name of students who have cat or dog pet.
  -> select distinct student.fname from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where pets.pettype in ('cat', 'dog')
  gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' or t3.pettype = 'dog'
  EM=6/58 EA=50/58 VS=58/58

[59/100] What are the first names of every student who has a cat or dog as a pet?
  -> select distinct student.fname from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where pets.pettype in ('cat', 'dog')
  gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' or t3.pettype = 'dog'
  EM=6/59 EA=51/59 VS=59/59

[60/100] Find the first name of students who have both cat and dog pets .

In [10]:
r3 = run(gen_nosub, "no_subproblem")

[1/100] How many singers do we have?
  -> select count(distinct singer_id) from singer
  gold: select count(*) from singer
  EM=0/1 EA=1/1 VS=1/1

[2/100] What is the total number of singers?
  -> select count(singer.singer_id) from singer
  gold: select count(*) from singer
  EM=0/2 EA=2/2 VS=2/2

[3/100] Show name, country, age for all singers ordered by age from the oldest to the youngest.
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=1/3 EA=3/3 VS=3/3

[4/100] What are the names, countries, and ages for every singer in descending order of age?
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=2/4 EA=4/4 VS=4/4

[5/100] What is the average, minimum, and maximum age of all singers from France?
  -> select avg(singer.age) as average_age, min(singer.age) as minimum_age, max(singer.age) as maximum_age from singer where singer.country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/5 EA=5/5 VS=5/5

[6/100] What is the average, minimum, and maximum age for all French singers?
  -> select avg(singer.age), min(singer.age), max(singer.age) from singer where singer.country = 'french'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/6 EA=6/6 VS=6/6

[7/100] Show the name and the release year of the song by the youngest singer.
  -> select name, song_release_year from singer where age = (select min(age) from singer)
  fix1: select song_name, song_release_year from singer where age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/7 EA=7/7 VS=7/7

[8/100] What are the names and release years for all the songs of the youngest singer?
  -> select name, song_name, song_release_year from singer where age = (select min(age) from singer) order by song_release_year
  fix1: select name, song_release_year from singer where age = (select min(age) from singer) order by song_release_year
  fix2: select song_name, song_release_year from singer where age = (select min(age) from singer) order by song_release_year
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/8 EA=8/8 VS=8/8

[9/100] What are all distinct countries where singers above age 20 are from?
  -> select distinct singer.country from singer where singer.age > 20
  gold: select distinct country from singer where age > 20
  EM=2/9 EA=9/9 VS=9/9

[10/100] What are  the different countries with singers above age 20?
  -> select distinct singer.country from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id where singer.age > 20
  fix1: select distinct country from singer where age > 20
  gold: select distinct country from singer where age > 20
  EM=3/10 EA=10/10 VS=10/10

[11/100] Show all countries and the number of singers in each country.
  -> select singer.country, count(singer.singer_id) from singer left join singer_in_concert on singer.singer_id = singer_in_concert.singer_id group by singer.country
  fix1: select country, count(singer_id) from singer group by country
  gold: select country, count(*) from singer group by country
  EM=3/11 EA=11/11 VS=11/11

[12/100] How many singers are from each country?
  -> select singer.country, count(singer.singer_id) from singer group by singer.country
  gold: select country, count(*) from singer group by country
  EM=3/12 EA=12/12 VS=12/12

[13/100] List all song names by singers above the average age.
  -> select singer.name, concert.concert_name from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where singer.age > (select avg(age) from singer)
  fix1: select 'query cannot be answered: no song table exists in the provided schema' as error
  fix2: select 'query cannot be answered: no table linking singers to songs exists in the provided schema' as error
  fix3: select name from singer where age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=3/13 EA=12/13 VS=13/13

[14/100] What are all the song names by singers who are older than average?
  -> select s.name, s.song_name from singer s join singer_in_concert sic on s.singer_id = sic.singer_id where s.age > (select avg(age) from singer)
  fix1: select s.name, s.song_name from singer s where s.age > (select avg(age) from singer)
  fix2: select song_name from singer where age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=4/14 EA=13/14 VS=14/14

[15/100] Show location and name for all stadiums with a capacity between 5000 and 10000.
  -> select stadium.location, stadium.name from stadium where stadium.capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=4/15 EA=14/15 VS=15/15

[16/100] What are the locations and names of all stations with capacity between 5000 and 10000?
  -> select stadium.location, stadium.name, stadium.capacity from stadium where stadium.capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=4/16 EA=15/16 VS=16/16

[17/100] What is the maximum capacity and the average of all stadiums ?
  -> select max(capacity) as max_capacity, avg(average) as avg_average from stadium
  fix1: select max(capacity) as max_capacity, avg(capacity) as avg_capacity from stadium
  fix2: select max(capacity) as max_capacity, avg(average) as avg_average from stadium
  fix3: select max(capacity) as max_capacity, avg(capacity) as avg_average from stadium
  gold: select max(capacity), average from stadium
  EM=4/17 EA=15/17 VS=17/17

[18/100] What is the average and maximum capacities for all stadiums ?
  -> select avg(capacity) as average_capacity, max(capacity) as maximum_capacity from stadium
  gold: select avg(capacity), max(capacity) from stadium
  EM=4/18 EA=16/18 VS=18/18

[19/100] What is the name and capacity for the stadium with highest average attendance?
  -> select name, capacity from stadium order by average desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=5/19 EA=17/19 VS=19/19

[20/100] What is the name and capacity for the stadium with the highest average attendance?
  -> select stadium.name, stadium.capacity, avg(stadium.average) as avg_attendance from stadium join concert on stadium.stadium_id = concert.stadium_id join singer_in_concert on concert.concert_id = singer_in_concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id group by stadium.stadium_id, stadium.name, stadium.capacity order by avg_attendance desc limit 1
  fix1: select name, capacity from stadium order by average desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=6/20 EA=18/20 VS=20/20

[21/100] How many concerts are there in year 2014 or 2015?
  -> select count(concert.concert_id) from concert where concert.year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=6/21 EA=19/21 VS=21/21

[22/100] How many concerts occurred in 2014 or 2015?
  -> select count(concert.concert_id) from concert where concert.year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=6/22 EA=20/22 VS=22/22

[23/100] Show the stadium name and the number of concerts in each stadium.
  -> select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  fix1: select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id
  fix2: select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  fix3: select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=6/23 EA=20/23 VS=23/23

[24/100] For each stadium, how many concerts play there?
  -> select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  fix1: select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  fix2: select stadium.name, count(concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  fix3: select stadium.name, count(distinct concert.concert_id) from stadium left join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=6/24 EA=20/24 VS=24/24

[25/100] Show the stadium name and capacity with most number of concerts in year 2014 or after.
  -> select stadium.name, stadium.capacity from concert join stadium on concert.stadium_id = stadium.stadium_id where concert.year >= 2014 group by concert.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t2.stadium_id order by count(*) desc limit 1
  EM=6/25 EA=21/25 VS=25/25

[26/100] What is the name and capacity of the stadium with the most concerts after 2013 ?
  -> select stadium.name, stadium.capacity from concert join stadium on concert.stadium_id = stadium.stadium_id where concert.year > 2013 group by concert.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year > 2013 group by t2.stadium_id order by count(*) desc limit 1
  EM=6/26 EA=22/26 VS=26/26

[27/100] Which year has most number of concerts?
  -> select year, count(concert_id) as concert_count from concert group by year order by concert_count desc limit 1
  fix1: select year, count(concert_id) as concert_count from concert group by year having count(concert_id) = ( select max(cnt) from ( select count(concert_id) as cnt from concert group by year ) as counts )
  fix2: select year, count(concert_id) as concert_count from concert group by year having count(concert_id) = ( select max(cnt) from ( select count(concert_id) as cnt from concert group by year ) as counts )
  fix3: select year, count(concert_id) as concert_count from concert group by year having count(concert_id) = ( select max(cnt) from ( select count(concert_id) as cnt from concert group by year ) as counts ) order by year
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=6/27 EA=22/27 VS=27/27

[28/100] What is the year that had the most concerts?
  -> select year from concert group by year order by count(concert_id) desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=6/28 EA=23/28 VS=28/28

[29/100] Show the stadium names without any concert.
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=6/29 EA=24/29 VS=29/29

[30/100] What are the names of the stadiums without any concerts?
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=6/30 EA=25/30 VS=30/30

[31/100] Show countries where a singer above age 40 and a singer below 30 are from.
  -> select singer.country from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where singer.age > 40 intersect select singer.country from singer where singer.age < 30
  gold: select country from singer where age > 40 intersect select country from singer where age < 30
  EM=6/31 EA=26/31 VS=31/31

[32/100] Show names for all stadiums except for stadiums having a concert in year 2014.
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id and concert.year = 2014 where concert.concert_id is null
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=6/32 EA=27/32 VS=32/32

[33/100] What are the names of all stadiums that did not have a concert in 2014?
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id and concert.year = 2014 where concert.concert_id is null
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=6/33 EA=28/33 VS=33/33

[34/100] Show the name and theme for all concerts and the number of singers in each concert.
  -> select concert.concert_name, concert.theme, count(singer.singer_id) from concert left join singer_in_concert on concert.concert_id = singer_in_concert.concert_id left join singer on singer_in_concert.singer_id = singer.singer_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=6/34 EA=29/34 VS=34/34

[35/100] What are the names , themes , and number of singers for every concert ?
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=6/35 EA=30/35 VS=35/35

[36/100] List singer names and number of concerts for each singer.
  -> select singer.name, count(singer_in_concert.concert_id) as number_of_concerts from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=6/36 EA=31/36 VS=36/36

[37/100] What are the names of the singers and number of concerts for each person?
  -> select singer.name, count(concert.concert_id) from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=6/37 EA=32/37 VS=37/37

[38/100] List all singer names in concerts in year 2014.
  -> select singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=6/38 EA=33/38 VS=38/38

[39/100] What are the names of the singers who performed in a concert in 2014?
  -> select singer.name from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id join singer on singer_in_concert.singer_id = singer.singer_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=6/39 EA=34/39 VS=39/39

[40/100] what is the name and nation of the singer who have a song having 'Hey' in its name?
  -> select singer.name, singer.country from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where singer.song_name like '%hey%'
  fix1: select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=7/40 EA=35/40 VS=40/40

[41/100] What is the name and country of origin of every singer who has a song with the word 'Hey' in its title?
  -> select singer.name, singer.country from singer join singer_in_concert on singer.singer_id = singer_in_concert.singer_id where singer.song_name like '%hey%'
  fix1: select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=8/41 EA=36/41 VS=41/41

[42/100] Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015.
  -> select distinct s.name, s.location from stadium s join concert c2014 on s.stadium_id = c2014.stadium_id and c2014.year = 2014 join concert c2015 on s.stadium_id = c2015.stadium_id and c2015.year = 2015
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=8/42 EA=37/42 VS=42/42

[43/100] What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015?
  -> select stadium.name, stadium.location from stadium where stadium.stadium_id in ( select distinct stadium.stadium_id from concert join stadium on concert.stadium_id = stadium.stadium_id where concert.year = 2014 intersect select distinct stadium.stadium_id from concert join stadium on concert.stadium_id = stadium.stadium_id where concert.year = 2015 )
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=8/43 EA=38/43 VS=43/43

[44/100] Find the number of concerts happened in the stadium with the highest capacity .
  -> select count(c.concert_id) from concert c join stadium s on c.stadium_id = s.stadium_id where s.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=8/44 EA=39/44 VS=44/44

[45/100] What are the number of concerts that occurred in the stadium with the largest capacity ?
  -> select count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id where stadium.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=8/45 EA=40/45 VS=45/45

[46/100] Find the number of pets whose weight is heavier than 10.
  -> select count(pets.petid) from pets where pets.weight > 10
  gold: select count(*) from pets where weight > 10
  EM=8/46 EA=41/46 VS=46/46

[47/100] How many pets have a greater weight than 10?
  -> select count(pets.petid) from pets where pets.weight > 10

In [11]:
r4 = run(gen_noschema, "no_schemalink")

[1/100] How many singers do we have?
  -> select count(distinct singer_id) from singer
  gold: select count(*) from singer
  EM=0/1 EA=1/1 VS=1/1

[2/100] What is the total number of singers?
  -> select count(*) from singer
  gold: select count(*) from singer
  EM=1/2 EA=2/2 VS=2/2

[3/100] Show name, country, age for all singers ordered by age from the oldest to the youngest.
  -> select s.name, s.country, s.age from singer s order by s.age desc
  gold: select name, country, age from singer order by age desc
  EM=1/3 EA=3/3 VS=3/3

[4/100] What are the names, countries, and ages for every singer in descending order of age?
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=2/4 EA=4/4 VS=4/4

[5/100] What is the average, minimum, and maximum age of all singers from France?
  -> select avg(singer.age), min(singer.age), max(singer.age) from singer where singer.country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/5 EA=5/5 VS=5/5

[6/100] What is the average, minimum, and maximum age for all French singers?
  -> select avg(singer.age), min(singer.age), max(singer.age) from singer where singer.country = 'french'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=2/6 EA=6/6 VS=6/6

[7/100] Show the name and the release year of the song by the youngest singer.
  -> select name, song_release_year from singer where age = (select min(age) from singer)
  fix1: select song_name, song_release_year from singer where age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/7 EA=7/7 VS=7/7

[8/100] What are the names and release years for all the songs of the youngest singer?
  -> select s.name, s.song_name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  fix1: select s.song_name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=2/8 EA=8/8 VS=8/8

[9/100] What are all distinct countries where singers above age 20 are from?
  -> select distinct singer.country from singer where singer.age > 20
  gold: select distinct country from singer where age > 20
  EM=2/9 EA=9/9 VS=9/9

[10/100] What are  the different countries with singers above age 20?
  -> select distinct country from singer where age > 20
  gold: select distinct country from singer where age > 20
  EM=3/10 EA=10/10 VS=10/10

[11/100] Show all countries and the number of singers in each country.
  -> select country, count(singer_id) from singer group by country
  gold: select country, count(*) from singer group by country
  EM=3/11 EA=11/11 VS=11/11

[12/100] How many singers are from each country?
  -> select country, count(singer_id) from singer group by country
  gold: select country, count(*) from singer group by country
  EM=3/12 EA=12/12 VS=12/12

[13/100] List all song names by singers above the average age.
  -> select song_name from singer where age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=4/13 EA=13/13 VS=13/13

[14/100] What are all the song names by singers who are older than average?
  -> select s.name, s.song_name from singer s where s.age > (select avg(age) from singer)
  fix1: select distinct s.song_name from singer s where s.age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=4/14 EA=14/14 VS=14/14

[15/100] Show location and name for all stadiums with a capacity between 5000 and 10000.
  -> select location, name from stadium where capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=5/15 EA=15/15 VS=15/15

[16/100] What are the locations and names of all stations with capacity between 5000 and 10000?
  -> select location, name from stadium where capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=6/16 EA=16/16 VS=16/16

[17/100] What is the maximum capacity and the average of all stadiums ?
  -> select max(capacity), avg(average) from stadium
  fix1: select max(capacity), avg(capacity) from stadium
  fix2: select max(capacity) as max_capacity, avg(capacity) as average_capacity from stadium
  fix3: select max(capacity) as max_capacity, avg(average) as average_of_stadiums from stadium
  gold: select max(capacity), average from stadium
  EM=6/17 EA=16/17 VS=17/17

[18/100] What is the average and maximum capacities for all stadiums ?
  -> select avg(capacity) as average_capacity, max(capacity) as maximum_capacity from stadium
  gold: select avg(capacity), max(capacity) from stadium
  EM=6/18 EA=17/18 VS=18/18

[19/100] What is the name and capacity for the stadium with highest average attendance?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name, stadium.capacity order by avg(stadium.average) desc limit 1
  gold: select name, capacity from stadium order by average desc limit 1
  EM=6/19 EA=18/19 VS=19/19

[20/100] What is the name and capacity for the stadium with the highest average attendance?
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.stadium_id, stadium.name, stadium.capacity having avg(concert.average) = (select max(avg_att) from (select avg(average) as avg_att from concert group by stadium_id) as sub) order by avg(concert.average) desc limit 1
  fix1: select name, capacity from stadium where average = (select max(average) from stadium)
  gold: select name, capacity from stadium order by average desc limit 1
  EM=6/20 EA=19/20 VS=20/20

[21/100] How many concerts are there in year 2014 or 2015?
  -> select count(distinct concert_id) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=6/21 EA=20/21 VS=21/21

[22/100] How many concerts occurred in 2014 or 2015?
  -> select count(*) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=6/22 EA=21/22 VS=22/22

[23/100] Show the stadium name and the number of concerts in each stadium.
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=6/23 EA=22/23 VS=23/23

[24/100] For each stadium, how many concerts play there?
  -> select stadium.name, count(concert.concert_id) from stadium join concert on stadium.stadium_id = concert.stadium_id group by stadium.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=6/24 EA=23/24 VS=24/24

[25/100] Show the stadium name and capacity with most number of concerts in year 2014 or after.
  -> select stadium.name, stadium.capacity from stadium join concert on stadium.stadium_id = concert.stadium_id where concert.year >= 2014 group by stadium.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t2.stadium_id order by count(*) desc limit 1
  EM=6/25 EA=24/25 VS=25/25

[26/100] What is the name and capacity of the stadium with the most concerts after 2013 ?
  -> select stadium.name, stadium.capacity from concert join stadium on concert.stadium_id = stadium.stadium_id where concert.year > 2013 group by stadium.stadium_id, stadium.name, stadium.capacity order by count(concert.concert_id) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year > 2013 group by t2.stadium_id order by count(*) desc limit 1
  EM=6/26 EA=25/26 VS=26/26

[27/100] Which year has most number of concerts?
  -> select year, count(concert_id) as concert_count from concert group by year order by concert_count desc limit 1
  fix1: select year, count(concert_id) as concert_count from concert group by year having count(concert_id) = (select max(cnt) from (select count(concert_id) as cnt from concert group by year) as counts)
  fix2: select year, count(concert_id) as concert_count from concert group by year order by concert_count desc limit 1
  fix3: select c.year, count(distinct sic.concert_id) as concert_count from singer_in_concert sic join concert c on sic.concert_id = c.concert_id group by c.year order by concert_count desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=6/27 EA=25/27 VS=27/27

[28/100] What is the year that had the most concerts?
  -> select concert.year, count(concert.concert_id) as concert_count from concert group by concert.year order by concert_count desc limit 1
  fix1: select year from concert group by year order by count(concert_id) desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=6/28 EA=26/28 VS=28/28

[29/100] Show the stadium names without any concert.
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=6/29 EA=27/29 VS=29/29

[30/100] What are the names of the stadiums without any concerts?
  -> select stadium.name from stadium left join concert on stadium.stadium_id = concert.stadium_id where concert.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=6/30 EA=28/30 VS=30/30

[31/100] Show countries where a singer above age 40 and a singer below 30 are from.
  -> select distinct country from singer where age > 40 intersect select distinct country from singer where age < 30
  gold: select country from singer where age > 40 intersect select country from singer where age < 30
  EM=6/31 EA=29/31 VS=31/31

[32/100] Show names for all stadiums except for stadiums having a concert in year 2014.
  -> select stadium.name from stadium where stadium.stadium_id not in (select stadium_id from concert where year = 2014)
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=6/32 EA=30/32 VS=32/32

[33/100] What are the names of all stadiums that did not have a concert in 2014?
  -> select distinct s.name from stadium s left join concert c on s.stadium_id = c.stadium_id and c.year = 2014 where c.concert_id is null
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=6/33 EA=31/33 VS=33/33

[34/100] Show the name and theme for all concerts and the number of singers in each concert.
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as singer_count from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=6/34 EA=32/34 VS=34/34

[35/100] What are the names , themes , and number of singers for every concert ?
  -> select concert.concert_name, concert.theme, count(singer_in_concert.singer_id) as number_of_singers from concert join singer_in_concert on concert.concert_id = singer_in_concert.concert_id group by concert.concert_id, concert.concert_name, concert.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=6/35 EA=33/35 VS=35/35

[36/100] List singer names and number of concerts for each singer.
  -> select singer.name, count(singer_in_concert.concert_id) as number_of_concerts from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id group by singer.singer_id, singer.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=6/36 EA=34/36 VS=36/36

[37/100] What are the names of the singers and number of concerts for each person?
  -> select s.name, count(sic.concert_id) as number_of_concerts from singer s join singer_in_concert sic on s.singer_id = sic.singer_id group by s.singer_id, s.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=6/37 EA=35/37 VS=37/37

[38/100] List all singer names in concerts in year 2014.
  -> select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix1: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix2: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix3: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=6/38 EA=35/38 VS=38/38

[39/100] What are the names of the singers who performed in a concert in 2014?
  -> select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix1: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix2: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  fix3: select distinct singer.name from singer_in_concert join singer on singer_in_concert.singer_id = singer.singer_id join concert on singer_in_concert.concert_id = concert.concert_id where concert.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=6/39 EA=35/39 VS=39/39

[40/100] what is the name and nation of the singer who have a song having 'Hey' in its name?
  -> select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=7/40 EA=36/40 VS=40/40

[41/100] What is the name and country of origin of every singer who has a song with the word 'Hey' in its title?
  -> select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=8/41 EA=37/41 VS=41/41

[42/100] Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015.
  -> select s.name, s.location from stadium s join concert c on s.stadium_id = c.stadium_id where c.year = 2014 intersect select s.name, s.location from stadium s join concert c on s.stadium_id = c.stadium_id where c.year = 2015
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=8/42 EA=38/42 VS=42/42

[43/100] What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015?
  -> select s.name, s.location from stadium s join concert c on s.stadium_id = c.stadium_id group by s.stadium_id, s.name, s.location having count(distinct c.year) = 2 and sum(case when c.year = 2014 then 1 else 0 end) > 0 and sum(case when c.year = 2015 then 1 else 0 end) > 0
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=8/43 EA=39/43 VS=43/43

[44/100] Find the number of concerts happened in the stadium with the highest capacity .
  -> select count(concert.concert_id) from concert join stadium on concert.stadium_id = stadium.stadium_id where stadium.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=8/44 EA=40/44 VS=44/44

[45/100] What are the number of concerts that occurred in the stadium with the largest capacity ?
  -> select count(c.concert_id) from concert c join stadium s on c.stadium_id = s.stadium_id where s.capacity = (select max(capacity) from stadium)
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=8/45 EA=41/45 VS=45/45

[46/100] Find the number of pets whose weight is heavier than 10.
  -> select count(pets.petid) from pets where pets.weight > 10
  gold: select count(*) from pets where weight > 10
  EM=8/46 EA=42/46 VS=46/46

[47/100] How many pets have a greater weight than 10?
  -> select count(pets.petid) from pets where pets.weight > 10
  gold: select count(*) from pets where weight > 10
  EM=8/47 EA=43/47 VS=47/47

[48/100] Find the weight of the youngest dog.
  -> select pets.weight from pets join has_pet on pets.petid = has_pet.petid where pets.pettype = 'dog' order by pets.pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=8/48 EA=44/48 VS=48/48

[49/100] How much does the youngest dog weigh?
  -> select pets.weight from pets join has_pet on pets.petid = has_pet.petid where pets.pettype = 'dog' order by pets.pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=8/49 EA=45/49 VS=49/49

[50/100] Find the maximum weight for each type of pet. List the maximum weight and pet type.
  -> select pettype, max(weight) as max_weight from pets group by pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=8/50 EA=46/50 VS=50/50

[51/100] List the maximum weight and type for each type of pet.
  -> select pettype, max(weight) as max_weight from pets group by pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=8/51 EA=47/51 VS=51/51

[52/100] Find number of pets owned by students who are older than 20.
  -> select count(has_pet.petid) from student join has_pet on student.stuid = has_pet.stuid where student.age > 20
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t1.age > 20
  EM=8/52 EA=48/52 VS=52/52

[53/100] How many pets are owned by students that have an age greater than 20?
  -> select count(distinct pets.petid) from student join has_pet on student.stuid = has_pet.stuid join pets on has_pet.petid = pets.petid where student.age > 20

In [12]:
r5 = run(gen_direct, "baseline", correct=False)

[1/100] How many singers do we have?
  -> select count(*) from singer
  gold: select count(*) from singer
  EM=1/1 EA=1/1 VS=1/1

[2/100] What is the total number of singers?
  -> select count(*) from singer
  gold: select count(*) from singer
  EM=2/2 EA=2/2 VS=2/2

[3/100] Show name, country, age for all singers ordered by age from the oldest to the youngest.
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=3/3 EA=3/3 VS=3/3

[4/100] What are the names, countries, and ages for every singer in descending order of age?
  -> select name, country, age from singer order by age desc
  gold: select name, country, age from singer order by age desc
  EM=4/4 EA=4/4 VS=4/4

[5/100] What is the average, minimum, and maximum age of all singers from France?
  -> select avg(age) as average_age, min(age) as minimum_age, max(age) as maximum_age from singer where country = 'france'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=4/5 EA=5/5 VS=5/5

[6/100] What is the average, minimum, and maximum age for all French singers?
  -> select avg(age) as average_age, min(age) as minimum_age, max(age) as maximum_age from singer where country = 'french'
  gold: select avg(age), min(age), max(age) from singer where country = 'france'
  EM=4/6 EA=6/6 VS=6/6

[7/100] Show the name and the release year of the song by the youngest singer.
  -> select s.song_name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=4/7 EA=7/7 VS=7/7

[8/100] What are the names and release years for all the songs of the youngest singer?
  -> select s.song_name, s.song_release_year from singer s where s.age = (select min(age) from singer)
  gold: select song_name, song_release_year from singer order by age limit 1
  EM=4/8 EA=8/8 VS=8/8

[9/100] What are all distinct countries where singers above age 20 are from?
  -> select distinct country from singer where age > 20
  gold: select distinct country from singer where age > 20
  EM=5/9 EA=9/9 VS=9/9

[10/100] What are  the different countries with singers above age 20?
  -> select distinct country from singer where age > 20
  gold: select distinct country from singer where age > 20
  EM=6/10 EA=10/10 VS=10/10

[11/100] Show all countries and the number of singers in each country.
  -> select country, count(*) as singer_count from singer group by country
  gold: select country, count(*) from singer group by country
  EM=6/11 EA=11/11 VS=11/11

[12/100] How many singers are from each country?
  -> select country, count(*) as singer_count from singer group by country
  gold: select country, count(*) from singer group by country
  EM=6/12 EA=12/12 VS=12/12

[13/100] List all song names by singers above the average age.
  -> select distinct s.song_name from singer s where s.age > (select avg(age) from singer)
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=6/13 EA=13/13 VS=13/13

[14/100] What are all the song names by singers who are older than average?
  -> select distinct s.song_name from singer s where s.age > ( select avg(age) from singer where age is not null )
  gold: select song_name from singer where age > (select avg(age) from singer)
  EM=6/14 EA=14/14 VS=14/14

[15/100] Show location and name for all stadiums with a capacity between 5000 and 10000.
  -> select location, name from stadium where capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=7/15 EA=15/15 VS=15/15

[16/100] What are the locations and names of all stations with capacity between 5000 and 10000?
  -> select location, name from stadium where capacity between 5000 and 10000
  gold: select location, name from stadium where capacity between 5000 and 10000
  EM=8/16 EA=16/16 VS=16/16

[17/100] What is the maximum capacity and the average of all stadiums ?
  -> select max(capacity) as max_capacity, avg(capacity) as avg_capacity from stadium
  gold: select max(capacity), average from stadium
  EM=8/17 EA=16/17 VS=17/17

[18/100] What is the average and maximum capacities for all stadiums ?
  -> select avg(capacity) as average_capacity, max(capacity) as maximum_capacity from stadium
  gold: select avg(capacity), max(capacity) from stadium
  EM=8/18 EA=17/18 VS=18/18

[19/100] What is the name and capacity for the stadium with highest average attendance?
  -> select name, capacity from stadium where highest = (select max(highest) from stadium)
  gold: select name, capacity from stadium order by average desc limit 1
  EM=8/19 EA=18/19 VS=19/19

[20/100] What is the name and capacity for the stadium with the highest average attendance?
  -> select name, capacity from stadium where average = (select max(average) from stadium)
  gold: select name, capacity from stadium order by average desc limit 1
  EM=8/20 EA=19/20 VS=20/20

[21/100] How many concerts are there in year 2014 or 2015?
  -> select count(*) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=8/21 EA=20/21 VS=21/21

[22/100] How many concerts occurred in 2014 or 2015?
  -> select count(*) from concert where year in (2014, 2015)
  gold: select count(*) from concert where year = 2014 or year = 2015
  EM=8/22 EA=21/22 VS=22/22

[23/100] Show the stadium name and the number of concerts in each stadium.
  -> select s.name as stadium_name, count(c.concert_id) as number_of_concerts from stadium s left join concert c on s.stadium_id = c.stadium_id group by s.stadium_id, s.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=8/23 EA=21/23 VS=23/23

[24/100] For each stadium, how many concerts play there?
  -> select s.stadium_id, s.name, count(c.concert_id) as concert_count from stadium s left join concert c on s.stadium_id = c.stadium_id group by s.stadium_id, s.name
  gold: select t2.name, count(*) from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id group by t1.stadium_id
  EM=8/24 EA=21/24 VS=24/24

[25/100] Show the stadium name and capacity with most number of concerts in year 2014 or after.
  -> select s.name, s.capacity from stadium s join concert c on s.stadium_id = c.stadium_id where c.year >= 2014 group by s.stadium_id order by count(*) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year >= 2014 group by t2.stadium_id order by count(*) desc limit 1
  EM=8/25 EA=22/25 VS=25/25

[26/100] What is the name and capacity of the stadium with the most concerts after 2013 ?
  -> select s.name, s.capacity from stadium s join concert c on s.stadium_id = c.stadium_id where c.year > 2013 group by s.stadium_id order by count(*) desc limit 1
  gold: select t2.name, t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year > 2013 group by t2.stadium_id order by count(*) desc limit 1
  EM=8/26 EA=23/26 VS=26/26

[27/100] Which year has most number of concerts?
  -> select year, count(*) as concert_count from concert group by year order by concert_count desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=8/27 EA=23/27 VS=27/27

[28/100] What is the year that had the most concerts?
  -> select year from concert group by year order by count(*) desc limit 1
  gold: select year from concert group by year order by count(*) desc limit 1
  EM=9/28 EA=24/28 VS=28/28

[29/100] Show the stadium names without any concert.
  -> select s.name from stadium s left join concert c on s.stadium_id = c.stadium_id where c.concert_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=9/29 EA=25/29 VS=29/29

[30/100] What are the names of the stadiums without any concerts?
  -> select s.name from stadium s left join concert c on s.stadium_id = c.stadium_id where c.stadium_id is null
  gold: select name from stadium where stadium_id not in (select stadium_id from concert)
  EM=9/30 EA=26/30 VS=30/30

[31/100] Show countries where a singer above age 40 and a singer below 30 are from.
  -> select distinct s1.country from singer s1 join singer s2 on s1.country = s2.country where s1.age > 40 and s2.age < 30
  gold: select country from singer where age > 40 intersect select country from singer where age < 30
  EM=9/31 EA=27/31 VS=31/31

[32/100] Show names for all stadiums except for stadiums having a concert in year 2014.
  -> select s.name from stadium s where s.stadium_id not in ( select distinct c.stadium_id from concert c where c.year = 2014 )
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=9/32 EA=28/32 VS=32/32

[33/100] What are the names of all stadiums that did not have a concert in 2014?
  -> select s.name from stadium s where s.stadium_id not in ( select distinct c.stadium_id from concert c where c.year = 2014 )
  gold: select name from stadium except select t2.name from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014
  EM=9/33 EA=29/33 VS=33/33

[34/100] Show the name and theme for all concerts and the number of singers in each concert.
  -> select c.concert_name, c.theme, count(sic.singer_id) as number_of_singers from concert c left join singer_in_concert sic on c.concert_id = sic.concert_id group by c.concert_id, c.concert_name, c.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=9/34 EA=30/34 VS=34/34

[35/100] What are the names , themes , and number of singers for every concert ?
  -> select c.concert_name, c.theme, count(sic.singer_id) as number_of_singers from concert c left join singer_in_concert sic on c.concert_id = sic.concert_id group by c.concert_id, c.concert_name, c.theme
  gold: select t2.concert_name, t2.theme, count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id = t2.concert_id group by t2.concert_id
  EM=9/35 EA=31/35 VS=35/35

[36/100] List singer names and number of concerts for each singer.
  -> select s.name, count(sic.concert_id) as number_of_concerts from singer s left join singer_in_concert sic on s.singer_id = sic.singer_id group by s.singer_id, s.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=9/36 EA=31/36 VS=36/36

[37/100] What are the names of the singers and number of concerts for each person?
  -> select s.name, count(sic.concert_id) as number_of_concerts from singer s left join singer_in_concert sic on s.singer_id = sic.singer_id group by s.singer_id, s.name
  gold: select t2.name, count(*) from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id group by t2.singer_id
  EM=9/37 EA=31/37 VS=37/37

[38/100] List all singer names in concerts in year 2014.
  -> select distinct s.name from singer s join singer_in_concert sic on s.singer_id = sic.singer_id join concert c on sic.concert_id = c.concert_id where c.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=9/38 EA=31/38 VS=38/38

[39/100] What are the names of the singers who performed in a concert in 2014?
  -> select distinct s.name from singer s join singer_in_concert sic on s.singer_id = sic.singer_id join concert c on sic.concert_id = c.concert_id where c.year = 2014
  gold: select t2.name from singer_in_concert as t1 join singer as t2 on t1.singer_id = t2.singer_id join concert as t3 on t1.concert_id = t3.concert_id where t3.year = 2014
  EM=9/39 EA=31/39 VS=39/39

[40/100] what is the name and nation of the singer who have a song having 'Hey' in its name?
  -> select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=10/40 EA=32/40 VS=40/40

[41/100] What is the name and country of origin of every singer who has a song with the word 'Hey' in its title?
  -> select name, country from singer where song_name like '%hey%'
  gold: select name, country from singer where song_name like '%hey%'
  EM=11/41 EA=33/41 VS=41/41

[42/100] Find the name and location of the stadiums which some concerts happened in the years of both 2014 and 2015.
  -> select distinct s.name, s.location from stadium s join concert c on s.stadium_id = c.stadium_id where c.year = 2014 and s.stadium_id in ( select stadium_id from concert where year = 2015 )
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=11/42 EA=34/42 VS=42/42

[43/100] What are the names and locations of the stadiums that had concerts that occurred in both 2014 and 2015?
  -> select distinct s.name, s.location from stadium s join concert c on s.stadium_id = c.stadium_id where c.year = 2014 and s.stadium_id in ( select stadium_id from concert where year = 2015 )
  gold: select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2014 intersect select t2.name, t2.location from concert as t1 join stadium as t2 on t1.stadium_id = t2.stadium_id where t1.year = 2015
  EM=11/43 EA=35/43 VS=43/43

[44/100] Find the number of concerts happened in the stadium with the highest capacity .
  -> select count(*) as number_of_concerts from concert c where c.stadium_id = ( select stadium_id from stadium order by capacity desc limit 1 )
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=11/44 EA=36/44 VS=44/44

[45/100] What are the number of concerts that occurred in the stadium with the largest capacity ?
  -> select count(*) as number_of_concerts from concert where stadium_id = ( select stadium_id from stadium order by capacity desc limit 1 )
  gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
  EM=11/45 EA=37/45 VS=45/45

[46/100] Find the number of pets whose weight is heavier than 10.
  -> select count(*) from pets where weight > 10
  gold: select count(*) from pets where weight > 10
  EM=12/46 EA=38/46 VS=46/46

[47/100] How many pets have a greater weight than 10?
  -> select count(*) from pets where weight > 10
  gold: select count(*) from pets where weight > 10
  EM=13/47 EA=39/47 VS=47/47

[48/100] Find the weight of the youngest dog.
  -> select weight from pets where pettype = 'dog' order by pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=13/48 EA=40/48 VS=48/48

[49/100] How much does the youngest dog weigh?
  -> select weight from pets where pettype = 'dog' order by pet_age asc limit 1
  gold: select weight from pets order by pet_age limit 1
  EM=13/49 EA=41/49 VS=49/49

[50/100] Find the maximum weight for each type of pet. List the maximum weight and pet type.
  -> select pettype, max(weight) as max_weight from pets group by pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=13/50 EA=42/50 VS=50/50

[51/100] List the maximum weight and type for each type of pet.
  -> select pettype, max(weight) as max_weight from pets group by pettype
  gold: select max(weight), pettype from pets group by pettype
  EM=13/51 EA=43/51 VS=51/51

[52/100] Find number of pets owned by students who are older than 20.
  -> select count(*) as num_pets from has_pet hp join student s on hp.stuid = s.stuid where s.age > 20
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t1.age > 20
  EM=13/52 EA=44/52 VS=52/52

[53/100] How many pets are owned by students that have an age greater than 20?
  -> select count(*) as pet_count from has_pet hp join student s on hp.stuid = s.stuid where s.age > 20
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid where t1.age > 20
  EM=13/53 EA=45/53 VS=53/53

[54/100] Find the number of dog pets that are raised by female students (with sex F).
  -> select count(*) as num_dog_pets from student s join has_pet hp on s.stuid = hp.stuid join pets p on hp.petid = p.petid where s.sex = 'f' and p.pettype = 'dog'
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t2.petid = t3.petid where t1.sex = 'f' and t3.pettype = 'dog'
  EM=13/54 EA=46/54 VS=54/54

[55/100] How many dog pets are raised by female students?
  -> select count(*) from pets p join has_pet hp on p.petid = hp.petid join student s on hp.stuid = s.stuid where p.pettype = 'dog' and s.sex = 'f'
  gold: select count(*) from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t2.petid = t3.petid where t1.sex = 'f' and t3.pettype = 'dog'
  EM=13/55 EA=47/55 VS=55/55

[56/100] Find the number of distinct type of pets.
  -> select count(distinct pettype) from pets
  gold: select count(distinct pettype) from pets
  EM=14/56 EA=48/56 VS=56/56

[57/100] How many different types of pet are there?
  -> select count(distinct pettype) from pets
  gold: select count(distinct pettype) from pets
  EM=15/57 EA=49/57 VS=57/57

[58/100] Find the first name of students who have cat or dog pet.
  -> select distinct s.fname from student s join has_pet hp on s.stuid = hp.stuid join pets p on hp.petid = p.petid where p.pettype in ('cat', 'dog')
  gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' or t3.pettype = 'dog'
  EM=15/58 EA=50/58 VS=58/58

[59/100] What are the first names of every student who has a cat or dog as a pet?
  -> select distinct s.fname from student s join has_pet hp on s.stuid = hp.stuid join pets p on hp.petid = p.petid where p.pettype in ('cat', 'dog')
  gold: select distinct t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' or t3.pettype = 'dog'
  EM=15/59 EA=51/59 VS=59/59

[60/100] Find the first name of students who have both cat and dog pets .
  -> select distinct s.fname from student s join has_pet hp1 on s.stuid = hp1.stuid join pets p1 on hp1.petid = p1.petid and p1.pettype = 'cat' join has_pet hp2 on s.stuid = hp2.stuid join pets p2 on hp2.petid = p2.petid and p2.pettype = 'dog'
  gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'dog'
  EM=15/60 EA=52/60 VS=60/60

[61/100] What are the students' first names who have both cats and dogs as pets?
  -> select distinct s.fname from student s join has_pet hp1 on s.stuid = hp1.stuid join pets p1 on hp1.petid = p1.petid and p1.pettype = 'cat' join has_pet hp2 on s.stuid = hp2.stuid join pets p2 on hp2.petid = p2.petid and p2.pettype = 'dog'
  gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'dog'
  EM=15/61 EA=53/61 VS=61/61

[62/100] Find the major and age of students who do not have a cat pet.

In [13]:
print()
print("="*55)
print(f"{'config':<28} {'EA':>8} {'EM':>8} {'Valid':>8}")
print("-"*55)
for name, r in [("Full SoT", r1),
                ("w/o correction", r2),
                ("w/o subproblem", r3),
                ("w/o schema linking", r4),
                ("baseline", r5)]:
    print(f"{name:<28} {r['ea%']:>7.1%} {r['em%']:>7.1%} {r['vs%']:>7.1%}")
print("="*55)

=======================================================
config                             EA       EM    Valid
-------------------------------------------------------
Full SoT                       89.0%   11.0%   99.0%
w/o correction                 85.0%    6.0%  100.0%
w/o subproblem                 90.0%   10.0%   99.0%
w/o schema linking             89.0%   12.0%  100.0%
baseline                       87.0%   21.0%  100.0%
=======================================================